# [Pandas](https://pandas.pydata.org/docs/user_guide/index.html)

In [1]:
import pandas as pd
import numpy as np

# 함수

    - 타이타닉 데이터 로드

In [2]:
import seaborn as sns

df = sns.load_dataset('titanic') # 타이타닉 데이터 받아오기

In [4]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### null 확인

In [6]:
df.isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [7]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [9]:
df.isnull().sum().sum() # 과정을 거치면서 차원이 낮아지는 것을 확인할 수 있다

869

In [10]:
df.info() #전체,수, null, 데이터 타입을 알 수 있다.

#object 문자열, category 범주, bool True False

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

# 통계

In [11]:
df_number = df.select_dtypes(include=np.number)
df_object = df.select_dtypes(exclude=np.number)

In [12]:
df_number.columns

Index(['survived', 'pclass', 'age', 'sibsp', 'parch', 'fare'], dtype='object')

### count()

In [13]:
df_number.count()

survived    891
pclass      891
age         714
sibsp       891
parch       891
fare        891
dtype: int64

### sum()

In [14]:
df_number.sum()

survived      342.0000
pclass       2057.0000
age         21205.1700
sibsp         466.0000
parch         340.0000
fare        28693.9493
dtype: float64

### mean()

In [15]:
df_number.mean()

survived     0.383838
pclass       2.308642
age         29.699118
sibsp        0.523008
parch        0.381594
fare        32.204208
dtype: float64

In [23]:
df_number.mean(1) #숫자 1을 넣으면, 인풋 기준으로 통계값이 나온다

0       5.541667
1      18.713883
2       6.320833
3      15.183333
4       7.675000
         ...
886     7.000000
887     8.500000
888     5.890000
889     9.666667
890     7.125000
Length: 891, dtype: float64

### median()

In [16]:
df_number.median()

survived     0.0000
pclass       3.0000
age         28.0000
sibsp        0.0000
parch        0.0000
fare        14.4542
dtype: float64

### min()

In [17]:
df_number.min()

survived    0.00
pclass      1.00
age         0.42
sibsp       0.00
parch       0.00
fare        0.00
dtype: float64

### max()

In [18]:
df_number.max()

survived      1.0000
pclass        3.0000
age          80.0000
sibsp         8.0000
parch         6.0000
fare        512.3292
dtype: float64

### abs()

In [19]:
df_number.abs()

     survived  pclass   age  sibsp  parch     fare
0           0       3  22.0      1      0   7.2500
1           1       1  38.0      1      0  71.2833
2           1       3  26.0      0      0   7.9250
3           1       1  35.0      1      0  53.1000
4           0       3  35.0      0      0   8.0500
..        ...     ...   ...    ...    ...      ...
886         0       2  27.0      0      0  13.0000
887         1       1  19.0      0      0  30.0000
888         0       3   NaN      1      2  23.4500
889         1       1  26.0      0      0  30.0000
890         0       3  32.0      0      0   7.7500

[891 rows x 6 columns]

### std()

In [20]:
df_number.std() #표준편차

survived     0.486592
pclass       0.836071
age         14.526497
sibsp        1.102743
parch        0.806057
fare        49.693429
dtype: float64

In [24]:
df_number.var() #분산

survived       0.236772
pclass         0.699015
age          211.019125
sibsp          1.216043
parch          0.649728
fare        2469.436846
dtype: float64

### value_counts()

In [25]:
df_object.columns

Index(['sex', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [26]:
df_object['class'].value_counts()

#value_counts 값에 대한 모든 발생 횟수를 반환한다

Third     491
First     216
Second    184
Name: class, dtype: int64

### unique() , nunique
    - 데이터 유일값과 개수 구하기

In [62]:
df_object['embarked'].unique() #데이터 유일값 찾기, 실무에서 많이 사용한다

array(['S', 'C', 'Q', nan], dtype=object)

In [63]:
df_object['embarked'].nunique()  #개수 구하기, 실무에서 많이 사용한다

3

### describe()

In [37]:
df.describe(include='all') #전체 통계값을 얻을 수 있다.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:
df.describe(include=np.number) #수에 대한 통계값

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [40]:
df.describe(exclude=np.number) #카테고리에 대한 통계값

         sex embarked  class  who adult_male deck  embark_town alive alone
count    891      889    891  891        891  203          889   891   891
unique     2        3      3    3          2    7            3     2     2
top     male        S  Third  man       True    C  Southampton    no  True
freq     577      644    491  537        537   59          644   549   537

In [41]:
df['adult_male'].describe() #Series에서도 동일하게 사용이 가능하다

count      891
unique       2
top       True
freq       537
Name: adult_male, dtype: object

### map()

In [43]:
x.map(y)

one      triangle
two        square
three      circle
dtype: object

In [65]:
x = pd.Series({'one':1,'two':3,'three':4})
y = pd.Series({1:'triangle', 2:'square',3:'circle'})

x.map(y)

# map 함수를 사용할 경우 x의 value값에 y의 키값이 같을 경우 할당되는 것을 확인 할 수 있다.
#map은 Series에서만 사용이 가능하다

one      triangle
two        circle
three         NaN
dtype: object

In [47]:
df['sex'].unique()

array(['male', 'female'], dtype=object)

In [46]:
df['sex'][:5]

0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object

In [48]:
replace_dict = {"male":1, "female":0}
df['sex'].map(replace_dict)[:5]

0    1
1    0
2    0
3    0
4    1
Name: sex, dtype: int64

In [66]:
df['sex'].map(lambda x: 1 if x == 'male' else 0)[:5]

# 위의 코드하고 같은 역활을 하는 모습을 볼 수 있다.

0    1
1    0
2    0
3    0
4    1
Name: sex, dtype: int64

### apply()

In [50]:
df_tmp = pd.DataFrame(np.arange(12).reshape(4,3), columns = ['a','b','c'])
df_tmp

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [51]:
df_tmp['a'].apply(lambda x:x*2) # Series에 적용됨

0     0
1     6
2    12
3    18
Name: a, dtype: int64

In [67]:
df_tmp.apply(lambda x: x.sum()) # column 합계

a          18
b          22
c          26
row_sum    66
a+2        26
a+b        40
dtype: int64

In [68]:
df_tmp.apply(lambda x: x.sum(),axis=1)  #row 합계

0     9
1    36
2    63
3    90
dtype: int64

In [55]:
df_tmp['row_sum'] = df_tmp.apply(lambda x:x.sum(),axis=1)

In [56]:
df_tmp['a+2'] = df_tmp.apply(lambda x:x['a']+2, axis=1)
df_tmp

   a   b   c  row_sum  a+2
0  0   1   2        3    2
1  3   4   5       12    5
2  6   7   8       21    8
3  9  10  11       30   11

In [57]:
def tmpFnc(a,b):
    return a+b

df_tmp['a+b'] = df_tmp.apply(lambda x:tmpFnc(x['a'], x['b']), axis=1)
df_tmp

   a   b   c  row_sum  a+2  a+b
0  0   1   2        3    2    1
1  3   4   5       12    5    7
2  6   7   8       21    8   13
3  9  10  11       30   11   19

### 집합

In [58]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [59]:
select_cols = ['age', 'sex', 'pclass', 'fare', 'survived']
df_groupby = df[select_cols]
df_groupby.head()

    age     sex  pclass     fare  survived
0  22.0    male       3   7.2500         0
1  38.0  female       1  71.2833         1
2  26.0  female       3   7.9250         1
3  35.0  female       1  53.1000         1
4  35.0    male       3   8.0500         0

### pivot_table

    - 데이터를 더 쉽게 그룹화, 요약 및 분석이 가능하다 
    - 데이터 중에서 두 개의 열을 각각 행 인덱스, 열 인덱스로 사용하여 데이터를 조회한다

In [60]:
df_groupby.columns

Index(['age', 'sex', 'pclass', 'fare', 'survived'], dtype='object')

In [69]:
pd.pivot_table(df_groupby, index='sex', columns= 'pclass', values= 'age', aggfunc='mean')

#aggfunc 각 그룹별로 조회할 자료를 표시

pclass          1          2          3
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [64]:
pd.pivot_table(df_groupby, index= 'sex', columns='pclass', values='age', aggfunc=['min','max'])

         min               max
pclass     1     2     3     1     2     3
sex
female  2.00  2.00  0.75  63.0  57.0  63.0
male    0.92  0.67  0.42  80.0  70.0  74.0

### groupby

    - 데이터를 그룹별로 분활하여 독립된 그룹에 대한 데이터 처리 혹은 통계량 확인이 가능

In [76]:
df.groupby('sex').mean()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

In [70]:
grouped = df_groupby.groupby(['sex'])

In [71]:
for i in grouped:
    print(type(i))

<class 'tuple'>
<class 'tuple'>

In [72]:
for key, group in grouped:
    print("*key", key)
    print("*count", len(group))
    print(group.head())
    print('\n')

*key female
*count 314
    age     sex  pclass     fare  survived
1  38.0  female       1  71.2833         1
2  26.0  female       3   7.9250         1
3  35.0  female       1  53.1000         1
8  27.0  female       3  11.1333         1
9  14.0  female       2  30.0708         1


*key male
*count 577
    age   sex  pclass     fare  survived
0  22.0  male       3   7.2500         0
4  35.0  male       3   8.0500         0
5   NaN  male       3   8.4583         0
6  54.0  male       1  51.8625         0
7   2.0  male       3  21.0750         0

In [73]:
grouped.mean()

              age    pclass       fare  survived
sex
female  27.915709  2.159236  44.479818  0.742038
male    30.726645  2.389948  25.523893  0.188908

In [74]:
grouped.median()

         age  pclass  fare  survived
sex
female  27.0     2.0  23.0       1.0
male    29.0     3.0  10.5       0.0

In [75]:
group_female = grouped.get_group('female')
group_female.head()

    age     sex  pclass     fare  survived
1  38.0  female       1  71.2833         1
2  26.0  female       3   7.9250         1
3  35.0  female       1  53.1000         1
8  27.0  female       3  11.1333         1
9  14.0  female       2  30.0708         1

### 기준으로 집합

In [77]:
grouped = df_groupby.groupby(['sex', 'pclass'])

In [78]:
for key,group in grouped:
    print("*key",key)
    print("*count", len(group))
    print(group.head())
    print('\n')

*key ('female', 1)
*count 94
     age     sex  pclass      fare  survived
1   38.0  female       1   71.2833         1
3   35.0  female       1   53.1000         1
11  58.0  female       1   26.5500         1
31   NaN  female       1  146.5208         1
52  49.0  female       1   76.7292         1


*key ('female', 2)
*count 76
     age     sex  pclass     fare  survived
9   14.0  female       2  30.0708         1
15  55.0  female       2  16.0000         1
41  27.0  female       2  21.0000         0
43   3.0  female       2  41.5792         1
53  29.0  female       2  26.0000         1


*key ('female', 3)
*count 144
     age     sex  pclass     fare  survived
2   26.0  female       3   7.9250         1
8   27.0  female       3  11.1333         1
10   4.0  female       3  16.7000         1
14  14.0  female       3   7.8542         0
18  31.0  female       3  18.0000         0


*key ('male', 1)
*count 122
     age   sex  pclass      fare  survived
6   54.0  male       1   51.8625         0
23  28.0  male       1   35.5000         1
27  19.0  male       1  263.0000         0
30  40.0  male       1   27.7208         0
34  28.0  male       1   82.1708         0


*key ('male', 2)
*count 108
     age   sex  pclass  fare  survived
17   NaN  male       2  13.0         1
20  35.0  male       2  26.0         0
21  34.0  male       2  13.0         1
33  66.0  male       2  10.5         0
70  32.0  male       2  10.5         0


*key ('male', 3)
*count 347
     age   sex  pclass     fare  survived
0   22.0  male       3   7.2500         0
4   35.0  male       3   8.0500         0
5    NaN  male       3   8.4583         0
7    2.0  male       3  21.0750         0
12  20.0  male       3   8.0500         0

In [79]:
grouped.mean()

                     age        fare  survived
sex    pclass
female 1       34.611765  106.125798  0.968085
       2       28.722973   21.970121  0.921053
       3       21.750000   16.118810  0.500000
male   1       41.281386   67.226127  0.368852
       2       30.740707   19.741782  0.157407
       3       26.507589   12.661633  0.135447

### agg

In [80]:
df_groupby['fare'].agg(['sum', 'mean'])

sum     28693.949300
mean       32.204208
Name: fare, dtype: float64

In [81]:
df_groupby['fare'].agg(lambda x:x.sum())

28693.9493

### groupby() 와 같이 사용

In [82]:
grouped = df_groupby.groupby(['sex'])

In [83]:
grouped.agg(['min', 'max'])

         age       pclass      fare           survived
         min   max    min max   min       max      min max
sex
female  0.75  63.0      1   3  6.75  512.3292        0   1
male    0.42  80.0      1   3  0.00  512.3292        0   1

In [84]:
grouped.agg({
    'fare': ['min', 'max'],
    'age': 'mean'
})

        fare                  age
         min       max       mean
sex
female  6.75  512.3292  27.915709
male    0.00  512.3292  30.726645

In [85]:
def min_max(x):
    return x.max() - x.min()

grouped.agg(min_max)

          age  pclass      fare  survived
sex
female  62.25       2  505.5792         1
male    79.58       2  512.3292         1

### transform()

In [88]:
grouped = df_groupby.groupby(['pclass'])

age_mean = grouped.age.mean()
age_std = grouped.age.std()

for key, group in grouped.age:
    group_zscore = (group - age_mean.loc[key]) / age_std.loc[key]
    print("*origin :", key)
    print(group_zscore.head(3))
    print('\n')

*origin : 1
1   -0.015770
3   -0.218434
6    1.065103
Name: age, dtype: float64


*origin : 2
9    -1.134029
15    1.794317
17         NaN
Name: age, dtype: float64


*origin : 3
0   -0.251342
2    0.068776
4    0.789041
Name: age, dtype: float64

In [89]:
def z_score(x):
    return (x - x.mean())/ x.std()
    
df_transform = grouped.age.transform(z_score)
print(df_transform.iloc[[1,3,6]])
print(df_transform.iloc[[9,15,17]])
print(df_transform.iloc[[0,2,4]])

1   -0.015770
3   -0.218434
6    1.065103
Name: age, dtype: float64
9    -1.134029
15    1.794317
17         NaN
Name: age, dtype: float64
0   -0.251342
2    0.068776
4    0.789041
Name: age, dtype: float64

In [91]:
test = grouped.filter(lambda x:x.age.mean() <30) # 그룹별 나이평균이 미만인 그룹
print(test.head())
print(test['pclass'].unique())

    age     sex  pclass     fare  survived
0  22.0    male       3   7.2500         0
2  26.0  female       3   7.9250         1
4  35.0    male       3   8.0500         0
5   NaN    male       3   8.4583         0
7   2.0    male       3  21.0750         0
[3 2]

In [92]:
grouped.apply(lambda x : x.describe()) # 그룹별 통계정보

                     age  pclass        fare    survived
pclass
1      count  186.000000   216.0  216.000000  216.000000
       mean    38.233441     1.0   84.154687    0.629630
       std     14.802856     0.0   78.380373    0.484026
       min      0.920000     1.0    0.000000    0.000000
       25%     27.000000     1.0   30.923950    0.000000
       50%     37.000000     1.0   60.287500    1.000000
       75%     49.000000     1.0   93.500000    1.000000
       max     80.000000     1.0  512.329200    1.000000
2      count  173.000000   184.0  184.000000  184.000000
       mean    29.877630     2.0   20.662183    0.472826
       std     14.001077     0.0   13.417399    0.500623
       min      0.670000     2.0    0.000000    0.000000
       25%     23.000000     2.0   13.000000    0.000000
       50%     29.000000     2.0   14.250000    0.000000
       75%     36.000000     2.0   26.000000    1.000000
       max     70.000000     2.0   73.500000    1.000000
3      count  355.000000   491.0  491.000000  491.000000
       mean    25.140620     3.0   13.675550    0.242363
       std     12.495398     0.0   11.778142    0.428949
       min      0.420000     3.0    0.000000    0.000000
       25%     18.000000     3.0    7.750000    0.000000
       50%     24.000000     3.0    8.050000    0.000000
       75%     32.000000     3.0   15.500000    0.000000
       max     74.000000     3.0   69.550000    1.000000

# 문제

>1. null인 값을 전체 값으로 나누기

>2. 주어진 매트릭스를 로우 컬럼 기준으로 평균 구하기

>3. (2,2)로 변환하기

In [3]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [8]:
df.isnull().sum() / df.shape[0]

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [12]:
import pandas as pd
import numpy as np
np.random.seed(42)
arr = np.random.randint(50,101,(4,3))
arr

array([[88, 78, 64],
       [92, 57, 70],
       [88, 68, 72],
       [60, 60, 73]])

In [14]:
df_arr = pd.DataFrame(arr)
df_arr

    0   1   2
0  88  78  64
1  92  57  70
2  88  68  72
3  60  60  73

In [15]:
df_arr.apply(lambda x:x.mean())

0    82.00
1    65.75
2    69.75
dtype: float64

In [16]:
df_arr.apply(lambda x:x.mean(), axis=1)

0    76.666667
1    73.000000
2    76.000000
3    64.333333
dtype: float64

In [17]:
arr[1:3,:2]

array([[92, 57],
       [88, 68]])